In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as snb

In [2]:
df = pd.read_csv('Downloads/titanic_data.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df["Age"].isnull().sum()

177

## Random Sample Technique

In [5]:
def fill(df):
    df["Age_Sample"] = df["Age"]
    a = df["Age"].dropna().sample(177,random_state=1)
    a.index = df[df["Age"].isnull()].index
    df.loc[df["Age"].isnull(),"Age_Sample"]= a
    
fill(df)

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_Sample'],
      dtype='object')

In [7]:
df["Age_Sample"].isnull().sum()

0

In [8]:
df = df.drop(["Age"],axis=1)

In [9]:
numerical_data  = df.select_dtypes(exclude='object')

In [10]:
numerical_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
SibSp          0
Parch          0
Fare           0
Age_Sample     0
dtype: int64

## One Hot Coding for Nominal data

## 1.Dummies

In [11]:
catagorical_data= df.select_dtypes(include='object')
catagorical_data.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [12]:
catagorical_data = catagorical_data.drop(['Name','Ticket'],axis=1)
catagorical_data.head()

      Sex Cabin Embarked
0    male   NaN        S
1  female   C85        C
2  female   NaN        S
3  female  C123        S
4    male   NaN        S

In [13]:
catagorical_data.isnull().sum()

Sex           0
Cabin       687
Embarked      2
dtype: int64

In [14]:
catagorical_data["Embarked"].mode()

0    S
dtype: object

In [15]:
catagorical_data["Embarked_replace"] = catagorical_data["Embarked"].fillna(catagorical_data["Embarked"].mode()[0])

In [16]:
catagorical_data.columns

Index(['Sex', 'Cabin', 'Embarked', 'Embarked_replace'], dtype='object')

In [17]:
catagorical_data= catagorical_data.drop(["Embarked"],axis=1)

In [18]:
catagorical_data["Embarked_replace"].value_counts()

S    646
C    168
Q     77
Name: Embarked_replace, dtype: int64

In [19]:
catagorical_data.head()

      Sex Cabin Embarked_replace
0    male   NaN                S
1  female   C85                C
2  female   NaN                S
3  female  C123                S
4    male   NaN                S

In [20]:
a=pd.get_dummies(catagorical_data["Sex"],drop_first=True)

In [21]:
a.head()

   male
0     1
1     0
2     0
3     0
4     1

In [22]:
b = pd.get_dummies(catagorical_data["Embarked_replace"],drop_first=True)

In [23]:
b.head()

   Q  S
0  0  1
1  0  0
2  0  1
3  0  1
4  0  1

In [24]:
catagorical_data = pd.concat([catagorical_data,a,b],axis=1)

In [25]:
catagorical_data.head()

      Sex Cabin Embarked_replace  male  Q  S
0    male   NaN                S     1  0  1
1  female   C85                C     0  0  0
2  female   NaN                S     0  0  1
3  female  C123                S     0  0  1
4    male   NaN                S     1  0  1

In [26]:
catagorical_data = catagorical_data.drop(["Sex","Embarked_replace"],axis=1)

In [27]:
catagorical_data.head()

  Cabin  male  Q  S
0   NaN     1  0  1
1   C85     0  0  0
2   NaN     0  0  1
3  C123     0  0  1
4   NaN     1  0  1

## Ordinal Data Handling

## 1.Target Concept

In [28]:
catagorical_data.isnull().sum()

Cabin    687
male       0
Q          0
S          0
dtype: int64

In [30]:
df = pd.read_csv('Downloads/titanic_data.csv')

In [31]:
df = df[["Cabin",'Survived']]

In [32]:
df.head()

  Cabin  Survived
0   NaN         0
1   C85         1
2   NaN         1
3  C123         1
4   NaN         0

In [33]:
import warnings
warnings.filterwarnings('ignore')

In [34]:
df["Cabin"]= df["Cabin"].fillna("Praveen")

In [35]:
df["Cabin"].value_counts()

Praveen        687
G6               4
C23 C25 C27      4
B96 B98          4
F2               3
              ...
F E69            1
C47              1
D30              1
B86              1
A24              1
Name: Cabin, Length: 148, dtype: int64

In [36]:
df["Cabin"].isnull().sum()

0

In [37]:
df["Cabin"] = df["Cabin"].astype(str).str[0]

In [38]:
df["Cabin"].value_counts()

P    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [39]:
a = df["Survived"].groupby(df['Cabin']).mean().sort_values(ascending=True).index
a

Index(['T', 'P', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [40]:
b = { j:i for i,j in enumerate(a)}
b

{'T': 0, 'P': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [41]:
df["Cabin"]= df["Cabin"].map(b)

In [42]:
df["Cabin"].head()

0    1
1    4
2    1
3    4
4    1
Name: Cabin, dtype: int64

In [43]:
df.head()

   Cabin  Survived
0      1         0
1      4         1
2      1         1
3      4         1
4      1         0

In [44]:
df = df.drop(['Survived'],axis=1)
df

     Cabin
0        1
1        4
2        1
3        4
4        1
..     ...
886      1
887      6
888      1
889      4
890      1

[891 rows x 1 columns]

In [45]:
numerical_data.head()

   PassengerId  Survived  Pclass  SibSp  Parch     Fare  Age_Sample
0            1         0       3      1      0   7.2500        22.0
1            2         1       1      1      0  71.2833        38.0
2            3         1       3      0      0   7.9250        26.0
3            4         1       1      1      0  53.1000        35.0
4            5         0       3      0      0   8.0500        35.0

In [46]:
catagorical_data.head()

  Cabin  male  Q  S
0   NaN     1  0  1
1   C85     0  0  0
2   NaN     0  0  1
3  C123     0  0  1
4   NaN     1  0  1

In [47]:
catagorical_data = catagorical_data.drop(["Cabin"],axis=1)

In [48]:
catagorical_data.head()

   male  Q  S
0     1  0  1
1     0  0  0
2     0  0  1
3     0  0  1
4     1  0  1

In [49]:
df.head()

   Cabin
0      1
1      4
2      1
3      4
4      1

In [50]:
df= pd.concat([numerical_data,catagorical_data,df],axis=1)

In [53]:
# Finall Every data convertd into numerical values for applying ML Algorithms

In [54]:
df.head()

,PassengerId,Survived,Pclass,SibSp,Parch,Fare,Age_Sample,male,Q,S,Cabin
0,1,0,3,1,0,7.2500,22.0,1,0,1,1
1,2,1,1,1,0,71.2833,38.0,0,0,0,4
2,3,1,3,0,0,7.9250,26.0,0,0,1,1
3,4,1,1,1,0,53.1000,35.0,0,0,1,4
4,5,0,3,0,0,8.0500,35.0,1,0,1,1